; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-32)
(:domain gripper-strips)
(:objects rooma roomb room3 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 )
(:init
(room rooma)
(room roomb)
(room room3)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room3)
(at ball31 room3)
(at ball32 room3)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at ball31 rooma)
(at ball32 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 7 of 32
2. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 7 of 32
3. (pick ball8 roomb right)
   deleted: (at ball8 roomb) (free right)
   added: (carry ball8 right)
   goals met: 7 of 32
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 7 of 32
5. (drop ball8 rooma right)
   deleted: (carry ball8 right)
   added: (at ball8 rooma) (free right)
   goals met: 8 of 32
6. (drop ball9 rooma left)
   deleted: (carry ball9 left)
   added: (at ball9 rooma) (free left)
   goals met: 9 of 32
7. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 9 of 32
8. (pick ball19 roomb left)
   deleted: (at ball19 roomb) (free left)
   added: (carry ball19 left)
   goals met: 9 of 32
9. (pick ball18 roomb right)
   deleted: (at ball18 roomb) (free right)
   added: (carry ball18 right)
   goals met: 9 of 32
10. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 9 of 32
11. (drop ball18 rooma right)
   deleted: (carry ball18 right)
   added: (at ball18 rooma) (free right)
   goals met: 10 of 32
12. (drop ball19 rooma left)
   deleted: (carry ball19 left)
   added: (at ball19 rooma) (free left)
   goals met: 11 of 32
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 32
14. (pick ball17 roomb left)
   deleted: (at ball17 roomb) (free left)
   added: (carry ball17 left)
   goals met: 11 of 32
15. (pick ball16 roomb right)
   deleted: (at ball16 roomb) (free right)
   added: (carry ball16 right)
   goals met: 11 of 32
16. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 11 of 32
17. (drop ball16 rooma right)
   deleted: (carry ball16 right)
   added: (at ball16 rooma) (free right)
   goals met: 12 of 32
18. (drop ball17 rooma left)
   deleted: (carry ball17 left)
   added: (at ball17 rooma) (free left)
   goals met: 13 of 32
19. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 13 of 32
20. (pick ball15 roomb left)
   deleted: (at ball15 roomb) (free left)
   added: (carry ball15 left)
   goals met: 13 of 32
21. (pick ball14 roomb right)
   deleted: (at ball14 roomb) (free right)
   added: (carry ball14 right)
   goals met: 13 of 32
22. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 13 of 32
23. (drop ball14 rooma right)
   deleted: (carry ball14 right)
   added: (at ball14 rooma) (free right)
   goals met: 14 of 32
24. (drop ball15 rooma left)
   deleted: (carry ball15 left)
   added: (at ball15 rooma) (free left)
   goals met: 15 of 32
25. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 15 of 32
26. (pick ball13 roomb left)
   deleted: (at ball13 roomb) (free left)
   added: (carry ball13 left)
   goals met: 15 of 32
27. (pick ball12 roomb right)
   deleted: (at ball12 roomb) (free right)
   added: (carry ball12 right)
   goals met: 15 of 32
28. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 15 of 32
29. (drop ball12 rooma right)
   deleted: (carry ball12 right)
   added: (at ball12 rooma) (free right)
   goals met: 16 of 32
30. (drop ball13 rooma left)
   deleted: (carry ball13 left)
   added: (at ball13 rooma) (free left)
   goals met: 17 of 32
31. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 17 of 32
32. (pick ball11 roomb left)
   deleted: (at ball11 roomb) (free left)
   added: (carry ball11 left)
   goals met: 17 of 32
33. (pick ball10 roomb right)
   deleted: (at ball10 roomb) (free right)
   added: (carry ball10 right)
   goals met: 17 of 32
34. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 17 of 32
35. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 17 of 32
36. (drop ball10 rooma right)
   deleted: (carry ball10 right)
   added: (at ball10 rooma) (free right)
   goals met: 18 of 32
37. (drop ball11 rooma left)
   deleted: (carry ball11 left)
   added: (at ball11 rooma) (free left)
   goals met: 19 of 32
38. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 19 of 32
39. (pick ball32 room3 left)
   deleted: (at ball32 room3) (free left)
   added: (carry ball32 left)
   goals met: 19 of 32
40. (pick ball31 room3 right)
   deleted: (at ball31 room3) (free right)
   added: (carry ball31 right)
   goals met: 19 of 32
41. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 19 of 32
42. (drop ball31 rooma right)
   deleted: (carry ball31 right)
   added: (at ball31 rooma) (free right)
   goals met: 20 of 32
43. (drop ball32 rooma left)
   deleted: (carry ball32 left)
   added: (at ball32 rooma) (free left)
   goals met: 21 of 32
44. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 21 of 32
45. (pick ball30 room3 left)
   deleted: (at ball30 room3) (free left)
   added: (carry ball30 left)
   goals met: 21 of 32
46. (pick ball29 room3 right)
   deleted: (at ball29 room3) (free right)
   added: (carry ball29 right)
   goals met: 21 of 32
47. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 21 of 32
48. (drop ball29 rooma right)
   deleted: (carry ball29 right)
   added: (at ball29 rooma) (free right)
   goals met: 22 of 32
49. (drop ball30 rooma left)
   deleted: (carry ball30 left)
   added: (at ball30 rooma) (free left)
   goals met: 23 of 32
50. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 23 of 32
51. (pick ball28 room3 left)
   deleted: (at ball28 room3) (free left)
   added: (carry ball28 left)
   goals met: 23 of 32
52. (pick ball27 room3 right)
   deleted: (at ball27 room3) (free right)
   added: (carry ball27 right)
   goals met: 23 of 32
53. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 23 of 32
54. (drop ball27 rooma right)
   deleted: (carry ball27 right)
   added: (at ball27 rooma) (free right)
   goals met: 24 of 32
55. (drop ball28 rooma left)
   deleted: (carry ball28 left)
   added: (at ball28 rooma) (free left)
   goals met: 25 of 32
56. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 25 of 32
57. (pick ball26 room3 left)
   deleted: (at ball26 room3) (free left)
   added: (carry ball26 left)
   goals met: 25 of 32
58. (pick ball25 room3 right)
   deleted: (at ball25 room3) (free right)
   added: (carry ball25 right)
   goals met: 25 of 32
59. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 25 of 32
60. (drop ball25 rooma right)
   deleted: (carry ball25 right)
   added: (at ball25 rooma) (free right)
   goals met: 26 of 32
61. (drop ball26 rooma left)
   deleted: (carry ball26 left)
   added: (at ball26 rooma) (free left)
   goals met: 27 of 32
62. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 27 of 32
63. (pick ball24 room3 left)
   deleted: (at ball24 room3) (free left)
   added: (carry ball24 left)
   goals met: 27 of 32
64. (pick ball23 room3 right)
   deleted: (at ball23 room3) (free right)
   added: (carry ball23 right)
   goals met: 27 of 32
65. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 27 of 32
66. (drop ball23 rooma right)
   deleted: (carry ball23 right)
   added: (at ball23 rooma) (free right)
   goals met: 28 of 32
67. (drop ball24 rooma left)
   deleted: (carry ball24 left)
   added: (at ball24 rooma) (free left)
   goals met: 29 of 32
68. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 29 of 32
69. (pick ball22 room3 left)
   deleted: (at ball22 room3) (free left)
   added: (carry ball22 left)
   goals met: 29 of 32
70. (pick ball21 room3 right)
   deleted: (at ball21 room3) (free right)
   added: (carry ball21 right)
   goals met: 29 of 32
71. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 29 of 32
72. (drop ball21 rooma right)
   deleted: (carry ball21 right)
   added: (at ball21 rooma) (free right)
   goals met: 30 of 32
73. (drop ball22 rooma left)
   deleted: (carry ball22 left)
   added: (at ball22 rooma) (free left)
   goals met: 31 of 32
74. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 31 of 32
75. (pick ball20 room3 left)
   deleted: (at ball20 room3) (free left)
   added: (carry ball20 left)
   goals met: 31 of 32
76. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 31 of 32
77. (drop ball20 rooma left)
   deleted: (carry ball20 left)
   added: (at ball20 rooma) (free left)
   goals met: 32 of 32
